testing/artillery-pusher-signaling.yml
config:
  target: "http://localhost:8000"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up to 50 RPS"
    
    # Sustained load phase
    - duration: 120
      arrivalRate: 50
      name: "Sustained 50 RPS"
    
    # Peak load phase
    - duration: 60
      arrivalRate: 50
      rampTo: 150
      name: "Peak to 150 RPS"
    
    # Cool-down phase
    - duration: 30
      arrivalRate: 10
      name: "Cool-down"

  processor: "./test-processor-livekit.js"
  
  # Pusher configuration
  variables:
    pusher_key: "{{ $processEnvironment.PUSHER_APP_KEY }}"
    pusher_cluster: "{{ $processEnvironment.PUSHER_APP_CLUSTER }}"

  # Hooks for comprehensive monitoring
  before:
    flow:
      - function: "startSystemMonitoring"
  
  after:
    flow:
      - function: "stopSystemMonitoring"
      - function: "generateComprehensiveReport"

  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  # Scenario 1: Viewer joins stream (Pusher signaling focus)
  - name: "Viewer Join Stream - Pusher Signaling"
    weight: 60
    flow:
      # 1. Get stream page
      - get:
          url: "/live-cam/{{ randomStreamSlug }}"
          capture:
            - json: "$.stream_id"
              as: "streamId"
          expect:
            - statusCode: 200
      
      # 2. Get LiveKit token (minimal, not focus)
      - get:
          url: "/live-cam/{{ randomStreamSlug }}/livekit/token"
          expect:
            - statusCode: 200
      
      # 3. FOCUS: Pusher signaling - Subscribe to channel
      - function: "subscribeToPusherChannel"
      
      # 4. FOCUS: Send chat message via Pusher
      - post:
          url: "/live-cam/{{ randomStreamSlug }}/chat"
          json:
            username: "Viewer-{{ $randomNumber() }}"
            message: "Test message {{ $randomString() }}"
          expect:
            - statusCode: 200
      
      # 5. FOCUS: Update viewer count via Pusher
      - post:
          url: "/live-cam/{{ randomStreamSlug }}/viewer-count"
          json:
            action: "join"
          expect:
            - statusCode: 200
      
      # 6. Simulate viewing for random duration
      - think: "{{ $randomNumber(5, 15) }}"
      
      # 7. FOCUS: Send another chat message
      - post:
          url: "/live-cam/{{ randomStreamSlug }}/chat"
          json:
            username: "Viewer-{{ $randomNumber() }}"
            message: "Another message {{ $randomString() }}"
          expect:
            - statusCode: 200
      
      # 8. FOCUS: Leave - update viewer count
      - post:
          url: "/live-cam/{{ randomStreamSlug }}/viewer-count"
          json:
            action: "leave"
          expect:
            - statusCode: 200

  # Scenario 2: Broadcaster actions (Pusher signaling focus)
  - name: "Broadcaster Actions - Pusher Signaling"
    weight: 20
    flow:
      # 1. Login as broadcaster
      - post:
          url: "/login"
          json:
            email: "broadcaster{{ $randomNumber(1, 5) }}@test.com"
            password: "password"
          expect:
            - statusCode: 200
      
      # 2. Get broadcaster page
      - get:
          url: "/admin/live-stream/{{ randomStreamSlug }}/broadcast"
          expect:
            - statusCode: 200
      
      # 3. Get LiveKit token
      - get:
          url: "/admin/live-stream/{{ randomStreamSlug }}/livekit/token"
          expect:
            - statusCode: 200
      
      # 4. FOCUS: Start stream (triggers Pusher event)
      - post:
          url: "/admin/live-stream/{{ randomStreamSlug }}/start"
          expect:
            - statusCode: 200
      
      # 5. FOCUS: Toggle mirror (Pusher broadcast)
      - post:
          url: "/admin/live-stream/{{ randomStreamSlug }}/mirror"
          json:
            is_mirrored: true
          expect:
            - statusCode: 200
      
      # 6. FOCUS: Send chat message
      - post:
          url: "/admin/live-stream/{{ randomStreamSlug }}/chat"
          json:
            username: "Broadcaster"
            message: "Hello viewers!"
          expect:
            - statusCode: 200
      
      # 7. Simulate streaming
      - think: "{{ $randomNumber(10, 30) }}"
      
      # 8. FOCUS: Stop stream (triggers Pusher event)
      - post:
          url: "/admin/live-stream/{{ randomStreamSlug }}/stop"
          expect:
            - statusCode: 200

  # Scenario 3: Chat-heavy scenario (Pusher stress test)
  - name: "Heavy Chat - Pusher Stress Test"
    weight: 20
    flow:
      # 1. Get stream page
      - get:
          url: "/live-cam/{{ randomStreamSlug }}"
          expect:
            - statusCode: 200
      
      # 2. FOCUS: Subscribe to Pusher
      - function: "subscribeToPusherChannel"
      
      # 3. FOCUS: Send multiple chat messages rapidly
      - loop:
          count: 10
          flow:
            - post:
                url: "/live-cam/{{ randomStreamSlug }}/chat"
                json:
                  username: "ChatUser-{{ $randomNumber() }}"
                  message: "Rapid message {{ $randomString() }}"
                expect:
                  - statusCode: 200
            - think: 0.5

# Custom metrics for Pusher performance
metrics:
  - name: "pusher_connection_time"
    type: "histogram"
  - name: "pusher_message_latency"
    type: "histogram"
  - name: "chat_message_count"
    type: "counter"
  - name: "viewer_count_updates"
    type: "counter"